from const.bot_link import BotLink


class BotText:
    CONSULTATION = f'''
*Консультация по закупкам товаров из Китая*

*Кому подходит:*
Тем кто хочет начать работать с Китаем, но не знает с чего начать и куда двигаться

*Формат:*
Персональная консультация в зуме длительностью 3-4 часа
После консультации у вас будет запись и файл с рекомендациями

*План работ:*
Вы приходите со списком товаров, которые хотели бы закупать. Мы с вами вместе проанализируем и посчитаем будет ли выгодно их начинать закупать.

Посчитаем таргет прайс (по какой цене выгодно будет закупать товар), а также какой бюджет нужен для закупки первой партии товара, а также какое количество товара вам нужно закупить для старта.

- Найдем поставщиков и проверим цены.

- Продумаем вашу упаковку и посчитаем примерную стоимость.

- Посчитаем стоимость доставки

+ Рассмотрим всю схему взаимодействия с китайскими поставщиками, как заказывать, как везти товар и т.д.
Что делать в случае брака, как избежать брака

Следующий созвон через три дня и мы обсуждаем ваши оставшиеся вопросы. После этого неделя обратной связи в телеграмме.

*Стоимость 28888 руб*
'''

    ABOUT = f'''
Коммерческая компания Moanna Yiwu Trading Co. LTD
Мы находимся в городе Иу
Бизнес лицензия номер 91330782MA2M2F3W94 от 09.04.2021

{BotLink.TELEGRAM}
{BotLink.INSTAGRAM}
'''

    AGENT = f'''
Вы хотите начать закупать товары в Китае, чтобы усилить конкурентное преимущество своего бизнеса? Мы поможем сделать этот процесс простым и эффективным.

Мы обеспечим легкое решение для вашего бизнеса:

Вы можете мучительно заниматься поиском поставщиков в Китае и пытаться вести свои сделки самостоятельно, а можете доверить это нам. Китай - это совершенно другой мир и тут нужен особый подход. К тому же без знания китайского языка очень сложно работать с китайскими поставщиками. Также если у вас нет представительства в Китае, то вам будет очень сложно контролировать процессы.

Мы предлагаем вам идеальное решение - мы полностью берем на себя проведение всех этапов сделки, включая юридическое сопровождение, проверку поставщиков, контроль производства заказа - все шаги от поиска поставщика до отгрузки товара и доставки на Ваш склад.


Как это работает?

1. Расскажите нам о вашем бизнесе и товарах, которые вы хотите закупать в Китае

2. Мы исследуем рынок, найдем поставщиков, проверим и выберем подходящих и надежных

3. Мы проведем переговоры с поставщиками о ценах, условиях доставки и других деталях сделки

4. Заключим контракт с поставщиком от имени нашей компании в Китае, что обеспечивает безопасность сделки

5. Мы проконтролируем процесс производства, сроки и качество продукции

6. Поможем оптимального маршрута и способа доставки товаров от производителя до вашего склада


Почему выбирают нас?

- Опыт работы с китайским рынком более 15 лет
- 100% надежность и конфиденциальность
- С нами размещать заказы китайским поставщикам легко и эффективно


Для того, чтобы начать работу заполните форму и отправьте мне, а я перешлю агенту.

Форма запроса:
{BotLink.FORM_REQUEST}
        '''

    BUYING = f'''
Также у нас есть услуга по выкупу товара по вашим ссылкам

Если вы уже нашли поставщика, но боитесь закупать у него самостоятельно и вам нужна помощь агента в сопровождении сделки под ключ, то в этом мы также можем вам помочь.
Для этого необходимо заполнить простую форму запроса, мы свяжемся с поставщиком и организуем закупку товара.

Как происходит процесс:
- мы оформляем заказ от имени китайской компании
-производим оплату поставщику
-принимаем товар на консолидационном складе, делаем вам фото и видео товара при необходимости
-упаковываем
-отправляем выбранным вами способом
Мы берем процент в зависимости от сложности исполнения заказа и его объема

Для того, чтобы начать работу заполните форму и отправьте мне, а я перешлю агенту.

Форма запроса:
{BotLink.FORM_BUY_GOODS}
'''

    DELIVERY = f'''
Мы предлагаем полный спектр услуг: от консолидации груза на складе и доставки, до представления интересов на таможне

- Многообразие вариантов доставки: Воздушная, морская, железнодорожная, мультимодальная перевозка — выбирайте оптимальный маршрут для вашего бизнеса
 
- Консолидация грузов на собственном складе в Китае - что обеспечивает сохранность вашего груза и исключит ошибки в отгрузке
 
- Таможенное Оформление: Мы берём на себя всю бумажную работу с документами (которую вы так сильно не любите), обеспечивая быстрый оформление таможенных процедур
 
- Дверь-в-Дверь: Предлагаем полный комплекс услуг по доставке от вашего поставщика до вашего склада
          
 Алгоритм действий
 
1. Предварительная расчет: отправьте нам информацию о вашем грузе для первичной консультации и расчета доставки и таможенных платежей
 
2. Подтверждение деталей: после согласования всех условий, мы начнем подготовку к отправке груза
3. Мы проконтролируем отгрузку и вам не нужно будет беспокоиться об этом
Подготовка пакета документов: мы подготовим и проверим все необходимые документы для таможенного оформления.
4. Представление ваших интересов на таможне: наши специалисты возьмут на себя представление груза и документов на таможенном посту. После успешного прохождения, груз будет готов к дальнейшей транспортировке или получению.
5. Доставка и приём груза: груз будет доставлен в указанное место в установленные сроки. Вы всегда будете знать где находится ваш груз
          
Почему выбрать нас?
 
- Большой опыт в таможенном оформлении
- Профессиональная команда специалистов по таможенному оформлению
 
С нами доставка и таможенное оформление грузов из Китая будет легким и быстрым!
        '''

    BRAND = f'''
Производство Товаров Под Вашим Брендом

Мы поможем вам осуществить вашу мечту - создать продукт под вашим брендом!
 
Мы полностью берем на себя весь процесс - от идеи до воплощения.
Наша опытная команда разработает дизайн упаковки, учитывая позиционирование вашего бренда,  ваши пожелания, а также соответствия требованиям маркетплейса.
  
Мы сами занимаемся поиском и отбором надежных поставщиков. Мы адаптируемся к вашим нуждам и возможностям, предлагая гибкие сроки и условия производства.
 
СТРОГАЯ КОНФИДЕНЦИАЛЬНОСТЬ:
Ваши идеи и бренд находятся в безопасности, благодаря строгим мерам конфиденциальности, которые мы принимаем, чтобы защитить ваш продукт.
 
1. Консультация и Планирование: Мы обсуждаем с вами все детали — от выбора материалов до дизайнерских решений.
 
2. Проектирование и создание образца прототипа: Прежде чем начать производство, мы создаем прототип (мастер сэмпл)  для подтверждения при необходимости.
 
3. Производство: после утверждения прототипа, начинается массовое производство.
 
4. Контроль качества и доставка: партия проходит контроль качества перед отгрузкой.
 
5. Вы получаете продукт под вашим брендом
 
Создайте продукт, которым вы будете гордиться, вместе с нами!
'''

    FULFILLMENT = f'''
Если вы заказываете небольшие партии товара с 1688 и вам до смерти надоело заниматься переупаковкой товара самим, переложить это дело на плечи поставщика не позволяют минимальное количество заказа фабрики.
Если вы хотите освободить себя от этой бесконечной работы кладовщика, и вам надоел склад дома, то мы можем предложить вам услуги фулфилмента в Китае.

Представьте, что весь товар будет приходить к вам полностью готовый под отгрузку на вайлдбериз. Больше никакой стикеровки, больше никакой отбраковки без возможности вернуть неликвидный товар.

Всё можно переупаковать прямо на складе в Китае, проверить товар по вашему ТЗ, нанести штрих-код этикетки для wb и ozon.

Товар приходит к вам упакованный в красивую упаковку (без иероглифов), простикерованный и вам остаётся только отгрузить на склады маркетплейсов.

Что мы предлагаем:

выкуп с 1688
фулфилмент (QC и переупаковка)
доставка в РФ

Условия:

комиссия в зависимости от стоимости партии

небольшие минимальные количества заказа

надежная доставка с гарантией

заказ пробной партии товара

тестирование образцов

Мы берём на себя все сложности, связанные с заказом товара в Китае.

Также у нас есть производство фирменной упаковки - профессиональный дизайн в подарок

Если вам интересна данная услуга, то просто напишите в ответ:
'''
